contrib-imola/cics-bc/jbi4cics/src/test/resources/xmlmessages/testOccursMessage.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:it.imolinfo.jbi4cics.test.webservices.utils.generators" xmlns:gen="http://generators.utils.webservices.test.jbi4cics.imolinfo.it">
   <soapenv:Body>
      <urn:provaOccursOperation>
         <urn:in0>
            <!--Optional:-->
            <gen:DFHCOMMAREA>
               <!--Optional:-->
               <gen:CA_RETCODE>1</gen:CA_RETCODE>
               <!--Optional:-->
               <gen:CA_SWSECI1_COMMAREA>
                  <!--Optional:-->
                  <gen:CA_CICS_ABSTIME>1</gen:CA_CICS_ABSTIME>
                  <!--Optional:-->
                  <gen:CA_CURRENT_DATE>AAA</gen:CA_CURRENT_DATE>
                  <!--Optional:-->
                  <gen:CA_CURRENT_TIME>bbb</gen:CA_CURRENT_TIME>
                  <!--Optional:-->
                  <gen:CA_ERROR_MESSAGE>CCC</gen:CA_ERROR_MESSAGE>
                  <!--Optional:-->
                  <gen:CA_NUMBER_OF_ROWS>2</gen:CA_NUMBER_OF_ROWS>
                  <!--Optional:-->
                  <gen:CA_ROW_DATA>
                     <!--Zero or more repetitions:-->
                     <gen:CA_ROW_DATA>
                        <!--Optional:-->
                        <gen:CA_DATA>AAA</gen:CA_DATA>
                        <!--Optional:-->
                        <gen:CA_ROW_NUMBER>11</gen:CA_ROW_NUMBER>
                        <!--Optional:-->
                        <gen:CA_ROW_NUM_AS_CHAR>zzz</gen:CA_ROW_NUM_AS_CHAR>
                     </gen:CA_ROW_DATA>
                     <gen:CA_ROW_DATA>
                        <!--Optional:-->
                        <gen:CA_DATA>BBB</gen:CA_DATA>
                        <!--Optional:-->
                        <gen:CA_ROW_NUMBER>222</gen:CA_ROW_NUMBER>
                        <!--Optional:-->
                        <gen:CA_ROW_NUM_AS_CHAR>xxx</gen:CA_ROW_NUM_AS_CHAR>
                     </gen:CA_ROW_DATA>
                     <gen:CA_ROW_DATA>
                        <!--Optional:-->
                        <gen:CA_DATA>CCC</gen:CA_DATA>
                        <!--Optional:-->
                        <gen:CA_ROW_NUMBER>333</gen:CA_ROW_NUMBER>
                        <!--Optional:-->
                        <gen:CA_ROW_NUM_AS_CHAR>yyy</gen:CA_ROW_NUM_AS_CHAR>
                     </gen:CA_ROW_DATA>                                          
                  </gen:CA_ROW_DATA>
               </gen:CA_SWSECI1_COMMAREA>
            </gen:DFHCOMMAREA>
         </urn:in0>
      </urn:provaOccursOperation>
   </soapenv:Body>
</soapenv:Envelope>